In [1]:
import pandas as pd

In [4]:
'l1 l2 l3 l4'.split()

['l1', 'l2', 'l3', 'l4']

In [2]:
data = [(1, 2, 3, 4),
        (5, 6, 7, 8),
        (8, 10, 11, 12),
        (13, 14, 15, 16)]
df = pd.DataFrame(data, 'l1 l2 l3 l4'.split(), 'c1 c2 c3 c4'.split())

In [3]:
df

    c1  c2  c3  c4
l1   1   2   3   4
l2   5   6   7   8
l3   8  10  11  12
l4  13  14  15  16

In [5]:
df['c1']

l1     1
l2     5
l3     8
l4    13
Name: c1, dtype: int64

In [6]:
type(df['c1'])

pandas.core.series.Series

In [10]:
df[['c3', 'c1']]

    c3  c1
l1   3   1
l2   7   5
l3  11   8
l4  15  13

In [11]:
type(df[['c3', 'c1']])

pandas.core.frame.DataFrame

In [12]:
df[:]

    c1  c2  c3  c4
l1   1   2   3   4
l2   5   6   7   8
l3   8  10  11  12
l4  13  14  15  16

In [13]:
df[1:]

    c1  c2  c3  c4
l2   5   6   7   8
l3   8  10  11  12
l4  13  14  15  16

In [14]:
df[::-1]

    c1  c2  c3  c4
l4  13  14  15  16
l3   8  10  11  12
l2   5   6   7   8
l1   1   2   3   4

In [15]:
df[1:3:]

    c1  c2  c3  c4
l2   5   6   7   8
l3   8  10  11  12

In [16]:
df[1:][['c3', 'c1']]

    c3  c1
l2   7   5
l3  11   8
l4  15  13

In [19]:
df.loc[['l3']]

    c1  c2  c3  c4
l3   8  10  11  12

In [20]:
df.loc[['l3', 'l2']]

    c1  c2  c3  c4
l3   8  10  11  12
l2   5   6   7   8

In [24]:
df.loc['l3', 'c1']

8

In [23]:
df.iloc[2]

c1     8
c2    10
c3    11
c4    12
Name: l3, dtype: int64

In [27]:
df

    c1  c2  c3  c4
l1   1   2   3   4
l2   5   6   7   8
l3   8  10  11  12
l4  13  14  15  16

In [30]:
df.loc[['l1', 'l3'], ['c1', 'c2']]

    c1  c2
l1   1   2
l3   8  10

In [31]:
df.iloc[[0, 2], [0, 1]]

    c1  c2
l1   1   2
l3   8  10